app/controllers/generator_controller.rb

SELECT * FROM "regions" WHERE ("regions"."fips" IN ('53',NULL))
SELECT * FROM "reports" WHERE ("reports"."domain" = 'performance')
---
  def show
    @states = State.find(:all)
    @pinned = %w{State County Csa Cbsa}.inject({}) do |result, el|
      result[el] = Region.find_all_by_fips(session[:pinned][el])
      result
    end
    @reports = %w{performance hcahps medicare mortality}.inject({}) do |result, el|
      result[el] = Report.find_all_by_domain(el)