app/controllers/regions_controller.rb

  def pin
    region = Region.find_by_fips(params[:state_fips] || params[:county_fips])
---
SELECT * FROM "regions" WHERE ("regions"."fips" = '53') LIMIT 1

  def unpin
    region = Region.find_by_fips(params[:fips])
---
SELECT * FROM "regions" WHERE ("regions"."fips" = '53') LIMIT 1